#language: ru

  Функционал:Яндекс Маркет
    @TestTV
    Сценарий:Подсчет телевизоров
      * Выбран пункт меню "Маркет"
      * Выбрана категория "Электроника"
      * Выбран тип текущей категории - "Телевизоры"
      * Нажата кнопка для перехода - "Все фильтры"
      * Введен параметр суммы:20000 рублей
      * Выбран первый производитель - "LG"
      * Выбран второй производитель - "Samsung"
      * Нажата кнопка подтверждения - "Показать"
      * Подсчет кол-ва отображаемых на странице товаров в категории - "Телевизор"
      * В поисковую строку вставлено значение первого элемента
      * Нажата кнопка поиска записанного товара
      * Проверить, что наименование товара соответствует запросу

    @TestHeadphones
    Сценарий: Поиск наушников
      * Выбран пункт меню "Маркет"
      * Выбрана категория "Электроника"
      * Выбран тип текущей категории - "Беспроводные наушники"
      * Нажата кнопка для перехода - "Все фильтры"
      * Введен параметр суммы:5000 рублей
      * Введено значение для поиска по фильтрам - "Sennheiser"
      * Выбран производитель - "Sennheiser"
      * Нажата кнопка подтверждения - "Показать"
      * Подсчет кол-ва отображаемых на странице товаров в категории - "наушники"
      * В поисковую строку вставлено значение первого элемента
      * Нажата кнопка поиска записанного товара
      * Проверить, что наименование товара соответствует запросу

